results/ASPLOS/WILDFIRE/YCSB-ROCKSDB-CORUN-200sec/50M-KEYS/8/batchsize-256/ycsbwklde/CII.out
Setting g_min_fd 3 
Setting g_min_fd 3 
RocksDB:    version 5.4
Date:       Sun Mar  3 22:10:46 2024
CPU:        128 * AMD EPYC 7543 32-Core Processor
CPUCache:   512 KB
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Keys:       20 bytes each
Values:     4096 bytes each (2048 bytes after compression)
Entries:    50000000
Prefix:    20 bytes
Keys per prefix:    0
RawSize:    196266.2 MB (estimated)
FileSize:   98609.9 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Memtablerep: prefix_hash
Perf Level: 1
------------------------------------------------
DB path: [/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/DATA]
ycsbwklde    :      75.341 micros/op 13272 ops/sec; ( reads:321100 writes:16899 total:50000000 found:0)
	Command being timed: "/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/db_bench --db=/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/DATA --num_levels=6 --key_size=20 --prefix_size=20 --memtablerep=prefix_hash --bloom_bits=10 --bloom_locality=1 --use_existing_db=1 --num=50000000 --duration=200 --compression_type=none --value_size=4096 --threads=8 --benchmarks=ycsbwklde --use_existing_db=1 --mmap_read=0 --threads=8"
	User time (seconds): 1023.70
	System time (seconds): 390.04
	Percent of CPU this job got: 693%
	Elapsed (wall clock) time (h:mm:ss or m:ss): 3:23.73
	Average shared text size (kbytes): 0
	Average unshared data size (kbytes): 0
	Average stack size (kbytes): 0
	Average total size (kbytes): 0
	Maximum resident set size (kbytes): 1932484
	Average resident set size (kbytes): 0
	Major (requiring I/O) page faults: 83
	Minor (reclaiming a frame) page faults: 2177249
	Voluntary context switches: 12005388
	Involuntary context switches: 2872
	Swaps: 0
	File system inputs: 335294264
	File system outputs: 43435536
	Socket messages sent: 0
	Socket messages received: 0
	Signals delivered: 0
	Page size (bytes): 4096
	Exit status: 0
[85982.305144] sh (260278): drop_caches: 3
[85982.397985] sh (260287): drop_caches: 3
[86016.594705] write_proc_unbounded: Value of write = 1
[86016.594717] write_proc_2mb_limit: Value of write = 1
[86016.594721] write_proc_bitmap_shift: Value of write = 38
[86016.601325] write_proc_unbounded: Value of write = 1
[86016.601336] write_proc_2mb_limit: Value of write = 1
[86016.601341] write_proc_bitmap_shift: Value of write = 38
[86017.390946] write_proc_unbounded: Value of write = 0
[86017.390958] write_proc_2mb_limit: Value of write = 0
[86017.390990] write_proc_unbounded: Value of write = 0
[86017.391000] write_proc_2mb_limit: Value of write = 0
[86017.391430] write_proc_unbounded: Value of write = 0
[86017.391444] write_proc_2mb_limit: Value of write = 0
[86017.391697] write_proc_unbounded: Value of write = 0
[86017.391708] write_proc_2mb_limit: Value of write = 0
[86017.391865] write_proc_unbounded: Value of write = 0
[86017.391871] write_proc_2mb_limit: Value of write = 0
[86017.391897] write_proc_unbounded: Value of write = 0
[86017.391904] write_proc_2mb_limit: Value of write = 0
[86017.392116] write_proc_unbounded: Value of write = 0
[86017.392121] write_proc_2mb_limit: Value of write = 0
[86017.392276] write_proc_unbounded: Value of write = 0
[86017.392285] write_proc_2mb_limit: Value of write = 0
[86017.392466] write_proc_unbounded: Value of write = 0
[86017.392472] write_proc_2mb_limit: Value of write = 0
[86017.392622] write_proc_unbounded: Value of write = 0
[86017.392630] write_proc_2mb_limit: Value of write = 0
[86017.393490] write_proc_unbounded: Value of write = 0
[86017.393502] write_proc_2mb_limit: Value of write = 0
[86017.395999] write_proc_unbounded: Value of write = 0
[86017.396006] write_proc_2mb_limit: Value of write = 0
[86017.396029] write_proc_unbounded: Value of write = 0
[86017.396032] write_proc_2mb_limit: Value of write = 0
[86017.396193] write_proc_unbounded: Value of write = 0
[86017.396199] write_proc_2mb_limit: Value of write = 0
[86017.396227] write_proc_unbounded: Value of write = 0
[86017.396232] write_proc_2mb_limit: Value of write = 0
[86017.396431] write_proc_unbounded: Value of write = 0
[86017.396439] write_proc_2mb_limit: Value of write = 0
[86017.396453] write_proc_unbounded: Value of write = 0
[86017.396461] write_proc_2mb_limit: Value of write = 0
[86017.396680] write_proc_unbounded: Value of write = 0
[86017.396685] write_proc_2mb_limit: Value of write = 0
[86017.396902] write_proc_unbounded: Value of write = 0
[86017.396908] write_proc_2mb_limit: Value of write = 0
[86017.399486] write_proc_unbounded: Value of write = 0
[86017.399493] write_proc_2mb_limit: Value of write = 0
[86017.399508] write_proc_unbounded: Value of write = 0
[86017.399517] write_proc_2mb_limit: Value of write = 0
[86017.411230] write_proc_unbounded: Value of write = 0
[86017.411238] write_proc_2mb_limit: Value of write = 0
[86017.411628] write_proc_unbounded: Value of write = 0
[86017.411638] write_proc_2mb_limit: Value of write = 0
[86017.411955] write_proc_unbounded: Value of write = 0
[86017.411961] write_proc_2mb_limit: Value of write = 0
[86017.412092] write_proc_unbounded: Value of write = 0
[86017.412097] write_proc_2mb_limit: Value of write = 0
[86017.412104] write_proc_unbounded: Value of write = 0
[86017.412109] write_proc_2mb_limit: Value of write = 0
[86017.412323] write_proc_unbounded: Value of write = 0
[86017.412329] write_proc_2mb_limit: Value of write = 0
[86017.414309] write_proc_unbounded: Value of write = 0
[86017.414315] write_proc_2mb_limit: Value of write = 0
[86017.414526] write_proc_unbounded: Value of write = 0
[86017.414531] write_proc_2mb_limit: Value of write = 0
[86017.414867] write_proc_unbounded: Value of write = 0
[86017.414873] write_proc_2mb_limit: Value of write = 0
[86017.416977] write_proc_unbounded: Value of write = 0
[86017.416982] write_proc_2mb_limit: Value of write = 0
[86017.417002] write_proc_unbounded: Value of write = 0
[86017.417007] write_proc_2mb_limit: Value of write = 0
[86220.270518] write_proc_unbounded: Value of write = 0
[86220.270530] write_proc_2mb_limit: Value of write = 0
[86220.324138] write_proc_unbounded: Value of write = 0
[86220.324149] write_proc_2mb_limit: Value of write = 0